wave_test/system/refineMeshDictY
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set box;

coordinateSystem global;

globalCoeffs
{
    tan1 (1 0 0);
    tan2 (0 1 0);
}

directions
(
    tan2
);

useHexTopology  true;

geometricCut    false;

writeMesh       false;


// ************************************************************************* //
